Домашние инвестиции/src/Catalogs/ВидыАктивов/ВидыАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыАктивов</name>
  <predefined>
    <items>
      <name>Акция</name>
      <description>Акция</description>
    </items>
    <items>
      <name>Облигация</name>
      <description>Облигация</description>
    </items>
    <items>
      <name>Фьючерс</name>
      <description>Фьючерс</description>
    </items>
    <items>
      <name>Валюта</name>
      <description>Валюта</description>
    </items>
    <items>
      <name>ETF</name>
      <description>ETF</description>
    </items>
  </predefined>
  <attributes>
    <name>БлокMOEX</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РынокMOEX</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Домашние инвестиции/src/Catalogs/ВидыАктивов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПредопределенные() Экспорт
	
	ЭлементETF = Справочники.ВидыАктивов.ETF.ПолучитьОбъект();
	ЭлементETF.БлокMOEX = "stock";
	ЭлементETF.РынокMOEX = "etf";
	ЭлементETF.Записать();

	ЭлементАкция = Справочники.ВидыАктивов.Акция.ПолучитьОбъект();
	ЭлементАкция.БлокMOEX = "stock";
	ЭлементАкция.РынокMOEX = "shares";
	ЭлементАкция.Записать();
	
	ЭлементФьючерс = Справочники.ВидыАктивов.Фьючерс.ПолучитьОбъект();
	ЭлементФьючерс.БлокMOEX = "futures";
	ЭлементФьючерс.РынокMOEX = "futures";
	ЭлементФьючерс.Записать();
	
	ЭлементОблигация = Справочники.ВидыАктивов.Облигация.ПолучитьОбъект();
	ЭлементОблигация.БлокMOEX = "bond";
	ЭлементОблигация.РынокMOEX = "bonds";
	ЭлементОблигация.Записать();
	
	ЭлементВалюта = Справочники.ВидыАктивов.Валюта.ПолучитьОбъект();
	ЭлементВалюта.БлокMOEX = "currency";
	ЭлементВалюта.РынокMOEX = "currencies";
	ЭлементВалюта.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
